---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.TooShort
source: html/82c469e6-5906-3017-5080-e2d47da138cb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.TooShort Property

Line is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooShort { get; }
```